## staging: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                   |
|--------|--------------------------------------------------------------------------|
| add    | `github_actions_secret.admin_github_manifests_workflow_token[0]`         |
|        | `github_actions_secret.api_github_manifests_workflow_token[0]`           |
|        | `github_actions_secret.dd_github_manifests_workflow_token[0]`            |
|        | `github_actions_secret.documentation_github_manifests_workflow_token[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.admin_github_manifests_workflow_token[0] will be created
  + resource "github_actions_secret" "admin_github_manifests_workflow_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "MANIFESTS_WORKFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.api_github_manifests_workflow_token[0] will be created
  + resource "github_actions_secret" "api_github_manifests_workflow_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-api"
      + secret_name     = "MANIFESTS_WORKFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dd_github_manifests_workflow_token[0] will be created
  + resource "github_actions_secret" "dd_github_manifests_workflow_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-document-download-api"
      + secret_name     = "MANIFESTS_WORKFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.documentation_github_manifests_workflow_token[0] will be created
  + resource "github_actions_secret" "documentation_github_manifests_workflow_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-documentation"
      + secret_name     = "MANIFESTS_WORKFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
